#include "MiNifarm.h"

//---ฟังก์ชั่นร้านค้า---//
void openShop() {
    clearScreen();
    cout << "--- SHOP --- (Money: $" << M << " | Gems: " << G << ")" << endl;
    cout << " 1) Fertilizer($50)  2) Sprinkler($150)  3) Expand(" << expansionCost << "G)" << endl;
    cout << " 4) CCTV($200)       5) Scarecrow($150)  6) Lottery($50)" << endl;
    cout << " 0) Exit" << endl;
    int sc; cin >> sc; //รับค่าตัวเลือกจากผู้เล่น
    if(sc==1){ int r; cout<<"Row: "; cin>>r; if(M>=50){M-=50; rows[r-1].hasFertilizer=true;} }
        //ถ้าเป็นเลข 1 จะรับค่าตำแหน่งแถวและเช็คว่าเงินมากกว่าหรือเท่ากับ 50 ถ้าผ่านเงื่อนไขก็จะหักเงินผู้เล่น 50 ตั้งค่าให้แถวที่ r-1 ใส่ปุ๋ย
    else if(sc==2){ int r; cout<<"Row: "; cin>>r; if(M>=150){M-=150; rows[r-1].sprinklerDays=3;} }
        //ถ้าเป็นเลข 2 จะรับค่าตำแหน่งแถวและเช็คว่าเงินมากกว่าหรือเท่ากับ 150 ถ้าผ่านเงื่อนไขก็จะหักเงินผู้เล่น 150 และตั้งค่าให้แถวที่ r-1 มีสปิกเกอร์
    else if(sc==3){ if(G >= expansionCost){G -= expansionCost; rows.push_back(Row()); expansionCost += 5;} }
        /*ถ้าเป็นเลข 3 จะเช็คว่ามี gem มากกว่าหรือเท่ากับค่า expansion มั้ย ถ้าผ่านเงื่อนไขก็จะหักจำนวน gem ตามค่า expansionCost 
        และเพิ่มจำนวนแถวขึ้นมา 1 แถวและเพิ่มค่าใช้จ่ายของ expansion ขึ้นอีก 5*/
    else if(sc==4){ if(M>=200){M-=200; hasCCTV=true;} }
        //ถ้าเป็นเลข 4 จะเช็คว่ามีเงินมากกว่าหรือเท่ากับ 200 มั้ย ถ้าผ่านเงื่อนไขจะหักเงินผู้เล่น 200 และตั้งค่าฟาร์มให้มีกล้องวงจรปิด
    else if(sc==5){ if(M>=150){M-=150; hasScarecrow=true;} }
        //ถ้าเป็นเลข 5 จะเช็คว่ามีเงินมากกว่าหรือเท่ากับ 150 มั้ย ถ้าผ่านเงื่อนไขจะหักเงินผู้เล่น 150 และตั้งค่าฟาร์มให้มีหุ่นไล่กา
    else if(sc==6){ if(M>=50){M-=50; hasLottery=true;} }
        //ถ้าเป็นเลข 6 จะเช็คว่ามีเงินมากกว่าหรือเท่ากับ 50 มั้ย ถ้าผ่านเงื่อนไขจะหักเงินผู้เล่น 50 และตั้งค่ามีลอตเตอรี่
}

int main(){
    openShop();
    return 0;
}